console.log("lang")

const langChoice = localStorage.getItem("lang")
if (!langChoice) {
	localStorage.setItem("lang", "ru")
}

function changeLanguage() {
	if (langChoice === "ru") {
		localStorage.setItem("lang", "kk")
	} else {
		localStorage.setItem("lang", "ru")
	}
	window.location.reload()
}

const langPicker = document.querySelector(".header-block__language")
if (langPicker) {
	langPicker.addEventListener("click", changeLanguage)
	langPicker.textContent = langChoice === "ru" ? "РУС" : "ҚАЗ"
}

import i18next from "i18next"

i18next.init({
	lng: langChoice,
	debug: true,
	resources: {
		ru: {
			// prettier-ignore
			translation: {
				"header": "Тест: Заслуживаешь ли ты звания Лесная Нимфа?",
				"footer": "Тест: Заслуживаешь ли ты звания Лесная Нимфа?",
				"true": "ПРАВДА",
				"false": "ЛОЖЬ",
				"retry": "",

				"index__1": "ПРАВДА ИЛИ ЛОЖЬ",
				"index__2": "Заслуживаешь ли ты звания Лесная нимфа? Проверь",
				"index__3": "Леса – лёгкие планеты. В наши дни уже никто не сомневается, что это так. Экологи объединяют усилия с политиками и корпорациями, чтобы сохранить и восстановить природное наследие, которое необходимо для благополучной и гармоничной жизни всего человечества. Благодаря бренду Naturella и Всемирному фонду природы в Казахстане у каждого есть возможность присоединиться к этому движению. Первый шаг – осведомлённость. В этом тесте мы собрали правдивые и ложные факты о природе планеты и Казахстана.",
				"index__4": "Проверь, насколько хорошо ты знаешь природу родной земли. \nИтак, правда или ложь?",
				"index__5": "Пройти тест",

				"test__question__1": "Хвойные деревья очищают воздух лучше, чем лиственные",
				"test__question__2": "Численность популяций диких животных на планете за 40 лет сократилась на 60%",
				"test__question__3": "К 2050 году среднегодовая температура в Казахстане будет достигать 30°С",
				"test__question__4": "Экосистема тугайных лесов в Казахстане смягчает последствия изменений климата?",
				"test__question__5": "На производство одного листа формата А4 уходит один килограмм древесины",
				"test__question__6": "Леса занимают 20% территории Казахстана",
				"test__question__7": "Тугайные леса называют оазисами пустыни",
				"test__question__8": "Река Или обеспечивает Балхаш 80% пресной воды и считается главной артерией озера",
				"test__question__9": "Стеклянные бутылки могут стать причиной лесных пожаров",
				"test__question__10": "Сгоревшему лесу для восстановления необходимо 1000 лет",

				"test__answer__1": "Все живые деревья и их листья отлично очищают воздух, снижая концентрации таких токсичных газов, как приземный озон, диоксид серы, оксиды азота. Они задерживают на своей поверхности взвешенные частицы c диаметром менее 10 и 2.5 мкм. Однако хвойные и лиственные деревья обладают разной способностью «впитывать» загрязнители воздуха. К такому выводу пришли <a class='test-question__link' href='https://www.sciencedirect.com/science/article/pii/S1470160X22011542?via%3Dihub' target='_blank'>учёные</a> из Гетеборгского университета. Результаты их исследования показали, что хвойные деревья поглощают больше газообразных полициклических ароматических углеводородов, чем лиственные деревья. Кроме того, они действуют как очистители воздуха зимой, когда загрязнение воздуха обычно наиболее велико. При этом лиственные породы значительно лучше удаляют из воздуха твердые частицы за счет большей площади поверхности. Так что и лиственные, и хвойные деревья – отличные очистители воздуха, просто у каждого из видов своя «специализация».",
				"test__answer__2": "Специалисты Всемирного фонда природы Казахстана  <a class='test-question__link' href='https://www.worldwildlife.org/pages/living-planet-report-2018' target='_blank'>пришли к выводу</a>, что за период с 1970 по 2014 годы среднее сокращение численности популяций в мире составило 60%. Эта цифра получила название индекса живой планеты (Living Planet Index, LPI). В его основе – исследование 16,7 тыс. популяций 4 тыс. видов диких животных. Этот показатель оказался намного выше в тропических лесах, где за 40 лет количество позвоночных млекопитающих снизилось на целых 89%.",
				"test__answer__3": "Швейцарская лаборатория Crowther Lab в своем исследовании <a class='test-question__link'href='https://crowtherlab.pageflow.io/cities-of-the-future-visualizing-climate-change-to-inspire-action#210424' target='_blank'>заключила</a>, что в ближайшие 30 лет значительное изменение климата затронет 77% городов Земли. Казахстан расположен на территории, где потепление идёт быстрее, чем в среднем на планете. Так, за последние 50 лет среднегодовая температура в мире увеличилась только на один градус, а в Казахстане – на полтора. При этом больше всего потепление коснулось зимнего периода и составило 4,4 градуса. К 2050 году среднегодовая температура в Казахстане <a class='test-question__link'href='https://ru.sputnik.kz/20190515/temperatura-kazakhstan-cherez-30-let-10153225.html' target='_blank'>увеличится</a> на 2-3°C. На севере страны она составит около +2,4°С, а на крайнем юге и юго-востоке – примерно +15,7 °С.",
				"test__answer__4": "Тугаи – особый тип экосистем, который включает в себя три вида деревьев – турангу, иву и лох. Они создают вокруг себя уникальные условия, благоприятные для строго определённых растений и животных. Тугаи считаются естественными водными регуляторами, они накапливают влагу во время дождя, чтобы отдать её в период засушливого лета. Такие экосистемы сдерживают воздействие негативных факторов – выхлопных газов, вредного солнечного излучения, а также защищают реки от пересыхания. Именно поэтому тугайные леса подлежат охране и восстановлению. В рамках совместного проекта Naturellа и Всемирного фонда природы в Казахстане в течение 2023-2024 годов будет восстановлено 4 гектара леса резервата «Иле-Балхаш».",
				"test__answer__5": "Промышленное производство бумаги началось в Европе с изобретением книгопечатанья в XV веке. Причём для её производства далеко не всегда использовалась древесина. Например, в Европе до 80-х годов XIX века бумагу варили из льняных и хлопчатобумажных тряпок – такие листы были намного более долговечными, чем современная бумага, средний срок жизни которой составляет не более девяти месяцев. Чтобы изготовить один лист стандартной офисной бумаги уходит в среднем 15-20 граммов древесины, а из миллиона деревьев получается около четырёх миллионов тонн бумаги. Из макулатуры бумагу произвести сложнее – чтобы спасти от вырубки одно дерево, требуется около восьмидесяти килограммов переработанной макулатуры.",
				"test__answer__6": "Согласно данным Комитета лесного хозяйства и животного мира Министерства экологии, геологии и природных ресурсов Казахстана леса <a class='test-question__link'href='https://www.undp.org/ru/kazakhstan/stories/%D0%BB%D0%B5%D1%81%D0%B0-%D0%BA%D0%B0%D0%B7%D0%B0%D1%85%D1%81%D1%82%D0%B0%D0%BD%D0%B0-%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%BE%D0%B5-%D1%81%D0%BE%D0%BA%D1%80%D0%BE%D0%B2%D0%B8%D1%89%D0%B5-%D0%B4%D0%BB%D1%8F-%D0%B1%D1%83%D0%B4%D1%83%D1%89%D0%B8%D1%85-%D0%BF%D0%BE%D0%BA%D0%BE%D0%BB%D0%B5%D0%BD%D0%B8%D0%B9' target='_blank'>занимают</a> 5% территории страны, а их площадь составляет 13,6 млн гектаров. ",
				"test__answer__7": "Тугайные леса – это своеобразный биологический оазис. Они становятся местом гнездования водоплавающих птиц, там обитают многие виды пресмыкающихся, земноводных, а также млекопитающих — лисиц, зайцев-толаев, шакалов, волков, гиен и многих других животных. Восстановление тугайных лесов – это важный шаг на пути сохранения природы Казахстана. Этой задаче уделяется особое внимание в рамках стратегического партнёрства P&G и Всемирного фонда природы  в Казахстане. Первый совместный проект 2023 года по восстановлению исчезающих лесов реализует бренд компании – Naturella.",
				"test__answer__8": "Река Или берёт начало в горах Северного Тянь-Шаня и впадает в озеро Балхаш. Она обеспечивает водоёму 80% пресной воды и считается главной артерией. Это одна из самых крупных рек области Жетысу, которая обмелела из-за лесных пожаров и деятельности человека. Рощи вдоль этой реки исчезают, от загрязнения воды снижается численность популяций редких видов животных. Например, в этом ареале обитают кулан, ястреб, занесенные в «Красную книгу». Проект по восстановлению тугайных лесов, реализуемый брендом женской гигиены Naturella, позволит возродить естественные коридоры перемещения диких животных по периметру водоёма и возобновить сеть гнездовых участков редких птиц.",
				"test__answer__9": "Согласно данным Бюро национальной статистики Казахстана в 2022 году каждый житель страны <a class='test-question__link' href='https://tengrinews.kz/article/100-kilogramm-musora-god-odnogo-kazahstantsa-reshit-problemu-2104/' target='_blank'>оставил</a> после себя около 100 килограмм мусора. Всего было собрано 3,8 млн тонн коммунальных отходов. К сожалению, некоторая их часть оказывается в лесу. Мусор может стать не только причиной отравления и ранений некоторых животных, но и может стать причиной пожара. Солнечный свет, преломлённый стеклянными бутылками, способен создавать фокусировку и высокую концентрацию тепла, что часто приводит к воспламенению хвороста и сухих листьев. Лучшее решение – ничего не выбрасывать в лесу.",
				"test__answer__10": "Скорость восстановления леса после пожара <a class='test-question__link' href='https://jfsi.ru/4-2-2021-geraskina_et_al/' target='_blank'>занимает</a> в среднем от 30 до 50 лет. Существенно ускорить этот процесс может помочь высадка деревьев. Важный этап восстановления тугайных лесов – это высадка саженцев туранги, лоха и ивы. Как раз этим займутся волонтеры экопроекта по восстановлению тугайных лесов. В результате проекта уже через несколько лет появится естественный подрост, который станет источником лесовосстановления больших площадей на территории Казахстана. <br> Напомним: <br> Номер телефона единой дежурно-диспетчерской службы ДЧС – 112 <br> Пожарная служба – 101 <br> Полиция – 102 <br> Скорая медицинская помощь – 103",

				"title__1": "",
				"title__description__1": "",
				"result__1": "",

				"title__2": "",
				"title__description__2": "",
				"result__2": "",

				"title__3": "",
				"title__description__3": "",
				"result__3": "",
			},
		},
		kk: {
			// prettier-ignore
			translation: {
				"header": "Тест: Орман сақшысы деген атқа лайықсың ба?",
				"footer": "Тест: Орман сақшысы деген атқа лайықсың ба?",
				"true": "ШЫН",
				"false": "ӨТІРІК",
				"retry": "",

				"index__1": "ШЫНДЫҚ НЕМЕСЕ ӨТІРІК",
				"index__2": "Орман сақшысы деген атқа лайықсың ба? Тексеріп көр",
				"index__3": "Орман – Жер-Ананың өкпесі. Бұған ешкім күмән келтірмейді. Экология мамандары табиғи мұраны сақтап, оны қалпына келтіру үшін саясаткерлер және корпорациялармен бірігіп жұмыс істеп келеді. Сондай қозғалыстың бірін Naturella бренді Қазақстандағы Дүниежүзілік табиғат қорымен бірігіп бастап отыр. Оған әр азамат үлесін қоса алады. Ең алғашқы қадам - хабардар болу. Біз Қазақстан табиғаты мен жалпы планета туралы шын және өтірік деректерді тест етіп жинадық." ,
				"index__4": "Туған жеріңіздің табиғатын қаншалықты білетініңізді тексеріп көріңіз.\nСонымен шын ба, өтірік пе?",
				"index__5": "Тест тапсырыңыз",
				
				"test__question__1": "Қылқан жапырақты ағаштар жапырақты ағаштарға қарағанда ауаны жақсы тазартады",
				"test__question__2": "Жер шарындағы жабайы жануарлар популяциясы 40 жылда 60% азайған",
				"test__question__3": "2050 жылға қарай Қазақстанда орташа жылдық температура 30°С-қа жетеді",
				"test__question__4": "Қазақстандағы тоғайлы орман экожүйесі климат өзгеруінің әсерін азайта ма?",
				"test__question__5": "Бір А4 парағын шығару үшін бір келі ағаш қажет",
				"test__question__6": "Қазақстан ормандары ел аумағының 20%-ын алып жатыр",
				"test__question__7": "Тоғай ормандарын шөлдің оазисі деп атайды",
				"test__question__8": "Іле өзені Балқашты 80% тұщы сумен қамтамасыз етеді және оның негізгі артериясы болып саналады",
				"test__question__9": "Шыны бөтелкелер орман өртіне себеп болады",
				"test__question__10": "Өртенген орман қалпына келуі үшін 1000 жыл қажет",

				"test__answer__1": "Барлық ағаш пен оның жапырағы ауаны жақсы тазартады. Оның әсерінен озон, күкірт диоксиді және азот оксиді сияқты улы газдардың концентрациясы төмендейді. Олар бетінде диаметрі 10 және 2,5 микрометрден аспайтын бөлшектерді ұстап қала алады. Дегенмен қылқан жапырақты және жапырақты ағаштардың ауадағы ластаушы заттарды «сіңіру» қабілеті әртүрлі. Гетеборг университетінің <a class='test-question__link' href='https://www.sciencedirect.com/science/article/pii/S1470160X22011542?via%3Dihub' target='_blank'>ғалымдары</a> осындай қорытындыға келді. Олардың зерттеу нәтижесі қылқан жапырақты ағаштар жапырақты ағаштарға қарағанда полициклді ароматты көмірсутекті газдарды көбірек сіңіретінін көрсетті. Тіпті ола ауа әдеттегіден көп ластанатын қыста тазартқыш ретінде әрекет етеді. Ал жапырақты ағаштар көлемінің үлкенірек болуына байланысты ауадағы бөлшектерді жақсы жояды. Сонымен жапырақты ағаштар да, қылқан жапырақты ағаштар да ауаны жақсы тазалайды. Тек әр түр өзіне тән «ерекше қабілетке» ие.",
				"test__answer__2": "Қазақстанның Дүниежүзілік табиғат қорының сарапшылары 1970 жылдан 2014 жылға дейін әлемде жануар популяциясының орташа қысқаруы 60% болды деген <a class='test-question__link' href='https://www.worldwildlife.org/pages/living-planet-report-2018' target='_blank'>қорытындыға келді</a>. Бұл көрсеткіш Living Planet Index (LPI) деп аталады. Ол жабайы жануарлардың 4 мың түрінің 16,7 мың популяциясын зерттеуге негізделген. Бұл көрсеткіш тропикалық ормандарда көбірек байқалды. Онда 40 жылда омыртқалы сүтқоректілердің саны 89% азайған.",
				"test__answer__3": "Швейцариялық Crowther Lab зертханасы зерттеуінде алдағы 30 жылда айтарлықтай климат өзгерісі жер бетіндегі қалалардың 77%-ына әсер етеді деген <a class='test-question__link'href='https://crowtherlab.pageflow.io/cities-of-the-future-visualizing-climate-change-to-inspire-action#210424' target='_blank'>қорытындыға</a> келді. Қазақстан жылынудың әлемдік орташа деңгейінен жылдамырақ болатын аймақта орналасқан. Осылайша кейінгі 50 жылда дүниежүзіндегі орташа жылдық температура тек 1 градусқа, ал Қазақстанда 1,5 градусқа жоғарылаған. Бұл ретте жылыну көбіне қысқы кезеңге әсер етіп, 4,4 градус болды. 2050 жылға қарай Қазақстанда орташа жылдық температура 2-3°С жоғарылайды. Елдің солтүстігінде шамамен +2,4°C, ал шеткі оңтүстік пен оңтүстік-шығыста шамамен +15,7°C болады.",
				"test__answer__4": "Тоғай – ағаштың тораңғы, тал және ақ кір деген үш түрінен тұратын ерекше экожүйе түрі. Тоғай сол жердің өсімдігі мен жануарларына қолайлы бірегей жағдай жасайды. Тоғайлар табиғи су реттегіші болып саналады. Олар жаңбыр кезінде ылғал жинап, құрғақ жазда оны шығара алады. Мұндай экожүйе пайдаланылған газдар, зиян күн радиациясы, өзеннің құрғауы сияқты жағымсыз факторлардың әсерін азайтады. Сондықтан тоғай ормандарын қорғау және қалпына келтіру керек. Naturella мен Дүниежүзілік табиғат қорының Қазақстандағы бірлескен жобасы аясында 2023-2024 жылдары Іле-Балқаш қорығындағы 4 гектар орман қалпына келмек.",
				"test__answer__5": "Қағаз өндірісі Еуропада XV ғасырда баспа ісі арқылы басталды. Дегенмен алғашында қағаз шығаруға ағаш қолданылған жоқ. Мысалы, Еуропада XIX ғасырдың 80-жылдарына дейін қағаз зығыр матадан және мақта матадан жасалды. Мұндай парақ қазіргі заманғы қағазға қарағанда әлдеқайда берік болды. Олардың орташа қызмет ету мерзімі тоғыз айдан аспайды. Ал стандартты кеңсе қағазының бір парағын жасау үшін орташа есеппен 15-20 грамм ағаш қажет. Ал миллион ағаш төрт миллион тоннаға жуық қағаз шығаруға жарайды. Десе де, макулатурадан қағаз өндіру қиынырақ. Себебі бір ағашты кеспей-ақ қағаз өндірем десеңіз, 80 келіге жуық қайта өңделген макулатура қажет.",
				"test__answer__6": "ҚР Экология, геология және табиғи ресурстар министрлігі Орман шаруашылығы және жануарлар дүниесі комитетінің мәліметінше, ормандар ел <a class='test-question__link'href='https://www.undp.org/ru/kazakhstan/stories/%D0%BB%D0%B5%D1%81%D0%B0-%D0%BA%D0%B0%D0%B7%D0%B0%D1%85%D1%81%D1%82%D0%B0%D0%BD%D0%B0-%D0%BF%D1%80%D0%B8%D1%80%D0%BE%D0%B4%D0%BD%D0%BE%D0%B5-%D1%81%D0%BE%D0%BA%D1%80%D0%BE%D0%B2%D0%B8%D1%89%D0%B5-%D0%B4%D0%BB%D1%8F-%D0%B1%D1%83%D0%B4%D1%83%D1%89%D0%B8%D1%85-%D0%BF%D0%BE%D0%BA%D0%BE%D0%BB%D0%B5%D0%BD%D0%B8%D0%B9' target='_blank'>аумағының</a> 5%-ын алып жатыр. Олардың жалпы ауданы - 13,6 миллион гектар.",
				"test__answer__7": "Тоғай ормандары – биологиялық оазистің бір түрі. Олар суда жүзетін құстардың ұя салатын мекені болады. Онда сонымен бірге бауырымен жорғалаушылардың, қосмекенділердің біраз түрі, сүтқоректілердің ішінде түлкі, қоян, қорқау қасқыры, гиена және тағы басқа көптеген жануар мекендейді. Тоғай ормандарын қалпына келтіру - Қазақстанның табиғатын сақтау жолындағы маңызды қадам. Бұл міндетке P&G мен Қазақстандағы Дүниежүзілік табиғат қоры арасындағы стратегиялық серіктестік аясында ерекше назар аударылады. Компанияның Naturella бренді жойылып кету қаупі төнген ормандарды қалпына келтіру бойынша 2023 жылғы бірінші бірлескен жобаны жүзеге асырмақ.",
				"test__answer__8": "Іле өзені Солтүстік Тянь-Шань тауларынан басталып, Балқаш көліне құяды. Ол су қоймасын 80% тұщы сумен қамтамасыз етеді және оның негізгі артериясы болып саналады. Іле -  Жетісу өңіріндегі орман өрті мен адам әрекетінің салдарынан тайызданып кеткен ірі өзендердің бірі. Бұл өзен бойындағы тоғайлар жойылып, судың ластануынан сирек кездесетін жануарлар түрлерінің саны азайып барады. Мысалы, бұл мекенде «Қызыл кітапқа» енген құлан мен қаршыға мекендейді. Naturella әйел гигиенасы бренді жүзеге асырып жатқан тоғайлы ормандарды қалпына келтіру жобасы су қоймасының периметрі бойынша жабайы жануарлардың қозғалысы үшін табиғи дәліздерді жандандырып, сирек кездесетін құстардың ұя салатын орнын қалпына келтіреді.",
				"test__answer__9": "Қазақстанның Ұлттық статистика бюросының мәліметінше, 2022 жылы еліміздің әр тұрғыны 100 келіге жуық қоқыс <a class='test-question__link' href='https://tengrinews.kz/article/100-kilogramm-musora-god-odnogo-kazahstantsa-reshit-problemu-2104/' target='_blank'>тастаған</a>. Барлығы 3,8 миллион тонна коммунал қалдық жиналған. Өкінішке қарай, оның біразы ұшып, орманға түседі. Қалдық жануарлардың улануы мен жарақаттануына әкеліп қана қоймай, сонымен бірге өртке де себеп болуы мүмкін. Шыны бөтелкеге түскен күн сәулесі жоғары жылу концентрациясын жасай алады. Ал бұл нәрсе өрт тұтануына әкелуі мүмкін. Бұл көбіне шыбық пен құрғақ жапырақтардың тұтануына әкеледі. Ең дұрысы - орманға ештеңе қалдырмау.",
				"test__answer__10": "Өрттен кейін орманды қалпына келтіру жылдамдығы орта есеппен 30-50 жылға <a class='test-question__link' href='https://jfsi.ru/4-2-2021-geraskina_et_al/' target='_blank'>созылады</a>. Ағаш егу бұл процесті айтарлықтай жылдамдатады. Тоғайлы ормандарды қалпына келтірудің маңызды кезеңі – тораңғы, ақ кір және ағаш тектес тал егу. Осы ретте тоғайлы ормандарды қалпына келтіру экожобасының волонтерлері дәл осы тәсілдерді жасайтынын айта кетейік. Нәтижесінде бірнеше жылда Қазақстандағы орман өсіру көзіне айналатын табиғи кең аумақтар пайда болады. <br> Еске саламыз: <br> ТЖД Бірыңғай кезекші-диспетчерлік қызметі – 112 <br> Өрт сөндіру қызметі – 101 <br> Полиция – 102 <br> Жедел жәрдем – 103",

				"title__1": "",
				"title__description__1": "",
				"result__1": "",

				"title__2": "",
				"title__description__2": "",
				"result__2": "",

				"title__3": "",
				"title__description__3": "",
				"result__3": "",
			},
		},
	},
})

const header = document.querySelector("h5.header__text")
const footer = document.querySelector("h6.footer__title")

const buttonsTrue = document.querySelectorAll("button#buttonTrue div")
const buttonsFalse = document.querySelectorAll("button#buttonFalse div")

if (header) {
	header.textContent = i18next.t("header")
}
if (footer) {
	footer.textContent = i18next.t("footer")
}
if (buttonsTrue.length && buttonsFalse.length) {
	buttonsTrue.forEach((buttonTrue) => {
		buttonTrue.textContent = i18next.t("true")
	})
	buttonsFalse.forEach((buttonFalse) => {
		buttonFalse.textContent = i18next.t("false")
	})
}

const index = document.querySelector(".test-page")
const test = document.querySelector(".wrapper")

if (index) {
	const index__1 = index.querySelector(
		"h3.test-page-description-heading__additional",
	)
	const index__2 = index.querySelector("h1.test-page-description-heading__main")
	const index__3 = index.querySelector("p.test-page-description__text")
	const index__4 = index.querySelector("h4.test-page-description-test__heading")
	const index__5 = index.querySelector("a.test-page-description-test__button")

	index__1.textContent = i18next.t("index__1")
	index__2.textContent = i18next.t("index__2")
	index__3.textContent = i18next.t("index__3")
	index__4.textContent = i18next.t("index__4")
	index__5.textContent = i18next.t("index__5")
}

if (test) {
	const test__question__1 = test.querySelector(
		"#question-1 h4.test-question-information__question",
	)
	const test__question__2 = test.querySelector(
		"#question-2 h4.test-question-information__question",
	)
	const test__question__3 = test.querySelector(
		"#question-3 h4.test-question-information__question",
	)
	const test__question__4 = test.querySelector(
		"#question-4 h4.test-question-information__question",
	)
	const test__question__5 = test.querySelector(
		"#question-5 h4.test-question-information__question",
	)
	const test__question__6 = test.querySelector(
		"#question-6 h4.test-question-information__question",
	)
	const test__question__7 = test.querySelector(
		"#question-7 h4.test-question-information__question",
	)
	const test__question__8 = test.querySelector(
		"#question-8 h4.test-question-information__question",
	)
	const test__question__9 = test.querySelector(
		"#question-9 h4.test-question-information__question",
	)
	const test__question__10 = test.querySelector(
		"#question-10 h4.test-question-information__question",
	)
	const test__answer__1 = test.querySelector(
		"#question-1 p.test-question__answer",
	)
	const test__answer__2 = test.querySelector(
		"#question-2 p.test-question__answer",
	)
	const test__answer__3 = test.querySelector(
		"#question-3 p.test-question__answer",
	)
	const test__answer__4 = test.querySelector(
		"#question-4 p.test-question__answer",
	)
	const test__answer__5 = test.querySelector(
		"#question-5 p.test-question__answer",
	)
	const test__answer__6 = test.querySelector(
		"#question-6 p.test-question__answer",
	)
	const test__answer__7 = test.querySelector(
		"#question-7 p.test-question__answer",
	)
	const test__answer__8 = test.querySelector(
		"#question-8 p.test-question__answer",
	)
	const test__answer__9 = test.querySelector(
		"#question-9 p.test-question__answer",
	)
	const test__answer__10 = test.querySelector(
		"#question-10 p.test-question__answer",
	)

	test__question__1.textContent = i18next.t("test__question__1")
	test__question__2.textContent = i18next.t("test__question__2")
	test__question__3.textContent = i18next.t("test__question__3")
	test__question__4.textContent = i18next.t("test__question__4")
	test__question__5.textContent = i18next.t("test__question__5")
	test__question__6.textContent = i18next.t("test__question__6")
	test__question__7.textContent = i18next.t("test__question__7")
	test__question__8.textContent = i18next.t("test__question__8")
	test__question__9.textContent = i18next.t("test__question__9")
	test__question__10.textContent = i18next.t("test__question__10")

	test__answer__1.innerHTML = i18next.t("test__answer__1")
	test__answer__2.innerHTML = i18next.t("test__answer__2")
	test__answer__3.innerHTML = i18next.t("test__answer__3")
	test__answer__4.textContent = i18next.t("test__answer__4")
	test__answer__5.textContent = i18next.t("test__answer__5")
	test__answer__6.innerHTML = i18next.t("test__answer__6")
	test__answer__7.textContent = i18next.t("test__answer__7")
	test__answer__8.textContent = i18next.t("test__answer__8")
	test__answer__9.innerHTML = i18next.t("test__answer__9")
	test__answer__10.innerHTML = i18next.t("test__answer__10")
}
